:PROPERTIES:
:ID:       027166e4-4321-4c75-8990-8198c7a47ae4
:END:
#+title: Cheatsheet: Hyprland

*** Active keyboard layout

List =$layout $variant= for the active keyboard input

#+name: hyprDevices
#+begin_src shell :results output silent code :wrap example json
hyprctl devices -j
#+end_src

JQ query

#+name: jqXkbLayout
#+begin_src jq :results output verbatim :stdin hyprDevices :compact yes
.keyboards
  | map(select(.main))
  | first
  | "\(.layout) \(.variant)"
#+end_src

#+RESULTS: jqXkbLayout
: "us altgr-intl"

One-liner

#+begin_src shell
hyprctl devices -j \
    | jq '.keyboards | map(select(.main)) | first | "\(.layout) \(.variant)"'
#+end_src

#+RESULTS:
: us altgr-intl

grep -C5 --include=*.nix -re environment.sessionVariables /data/ecto/x.files

* Notifications

#+begin_src shell :results output verbatim
delay=1
decay=5
i=-1
while [[ $i -lt 6 ]]; do
  t="$((1000 * ($decay - $i + 1)))"
  #color="rgb(123456) rgb(fcbda0) 45deg"
  color="rgb(123456)"
  font="fontsize:24"
  msg="$(echo asdf | sha256sum | tail -c16)"
  hyprctl notify $i "$t" "$color" "$msg"
  sleep $delay
  ((i++))
done

#for i in (0 1 2 3 4 5); do
#+end_src

#+RESULTS:
: ok
: ok
: ok
: ok
: ok
: ok
: ok


** Socket

Should be preferred over one-off bash scripts where possible ... e.g. for =eww= widgets

#+begin_src shell
awkProg='/^(active)?window>>/{print $0}'
hyprsock=$XDG_RUNTIME_DIR/hypr/$HYPRLAND_INSTANCE_SIGNATURE/.socket2.sock

# awk or sed can filter events
socat -u "UNIX-CONNECT:$hyprsock" - \
    | stdbuf -o0 \
      awk -F '>>|,' $awkProg

# this makes it a bit easier to follow events
socat -u "UNIX-CONNECT:$hyprsock" -

# and this emits notifications by wrapping event text in quotes
socat -u "UNIX-CONNECT:$hyprsock" - \
    | xargs -I'{}' notify-send --icon hyprsock '"{}"'

# notify-send -- can't be a builtin like echo
# -I'{} single quotes or \{\} to escape
# '"{}"' xargs eats the single-quotes, but subs {} in any strings.
#   a bit tricky, but it works here
#+end_src

This reverses a list of icons

#+begin_src shell :results output verbatim
iconset=/run/current-system/sw/share/icons/Adwaita/scalable/mimetypes
n=$(ls $iconset | wc -l)
# icons=$(ls $iconset)
icons=$(ls $iconset | sed -E 's/(.+)\.(svg|png|ico)/\1/g')

# modular arithmetic is dumb in awk. NR also can't be known in advance
# -8 % 3 == 2 == 8 % 3 ... when cycles are preserved in Z^3

ls $iconset \
    | tr ' ' '\n' \
    | awk -v arr="$icons" \
    'BEGIN { split(arr,ay," ") }
{ revi=length(ay) - (NR % length(ay));
  print ay[revi], NR, revi;
}' | tee >(xargs -n3 notify-send -i)

# tee reads from stdin, writes to its stdout
#   and broadcasts to xargs stdin

# xargs -I'{}' notify-send -i '{}' '{}' '{}' # broadcasts args 3x
#+end_src

#+RESULTS:
| x-office-spreadsheet-template  |  1 | 26 |
| x-office-spreadsheet           |  2 | 25 |
| x-office-presentation-template |  3 | 24 |
| x-office-presentation          |  4 | 23 |
| x-office-drawing               |  5 | 22 |
| x-office-document-template     |  6 | 21 |
| x-office-document              |  7 | 20 |
| x-office-addressbook           |  8 | 19 |
| video-x-generic                |  9 | 18 |
| text-x-script                  | 10 | 17 |
| text-x-preview                 | 11 | 16 |
| text-x-generic                 | 12 | 15 |
| text-html                      | 13 | 14 |
| package-x-generic              | 14 | 13 |
| model                          | 15 | 12 |
| inode-symlink                  | 16 | 11 |
| inode-directory                | 17 | 10 |
| image-x-generic                | 18 |  9 |
| font-x-generic                 | 19 |  8 |
| audio-x-generic                | 20 |  7 |
| application-x-sharedlib        | 21 |  6 |
| application-x-generic          | 22 |  5 |
| application-x-firmware         | 23 |  4 |
| application-x-executable       | 24 |  3 |
| application-x-addon            | 25 |  2 |
| application-certificate        | 26 |  1 |
| x-package-repository           | 27 | 27 |

This displays a random icon for each notification. =tee= records the output below,
which isn't emitted if =C-g= is used to prematurely kill the =ob-shell= process

#+begin_src shell :var awkprog=awkRandLine :results output verbatim
hyprsock=$XDG_RUNTIME_DIR/hypr/$HYPRLAND_INSTANCE_SIGNATURE/.socket2.sock
iconset=/run/current-system/sw/share/icons/Adwaita/scalable/mimetypes
n=$(ls $iconset | wc -l)
icons=$(ls $iconset | sed -E 's/(.+)\.(svg|png|ico)/\1/g')

socat -u "UNIX-CONNECT:$hyprsock" - \
    | stdbuf -o0 awk -v arr="$icons" $awkprog \
    | tee >(xargs -n3 notify-send -i)

#    | xargs -n3 notify-send -i
#    | xargs -I'{}' notify-send --icon hyprsock '"{}"'
#+end_src

#+RESULTS:
: application-certificate hyprsock 'focusedmon>>DP-2,2'
: application-x-addon hyprsock 'focusedmonv2>>DP-2,2'
: application-certificate hyprsock 'activewindow>>Alacritty,dc@kratos:~'
: application-x-executable hyprsock 'activewindowv2>>3f054490'
: application-x-firmware hyprsock 'activelayout>>hl-virtual-keyboard,English (intl., with AltGr dead keys)'
: application-x-generic hyprsock 'activelayout>>hl-virtual-keyboard,English (intl., with AltGr dead keys)'
: application-x-firmware hyprsock 'openlayer>>swaync-notification-window'
: application-x-executable hyprsock 'closelayer>>swaync-notification-window'
: font-x-generic hyprsock 'openlayer>>swaync-notification-window'

awkprog

#+name: awkRandLine
#+begin_example awk
function randint(n) { return int(n * rand()) }

BEGIN { split(arr,ay," "); }
{
  ico=randint(NR)+1; # a bit weird
  # print NR, ay[ico % length(ay)], "'$0'";
  printf "%s hyprsock '%s'\n", ay[ico % length(ay)], $0;
  next;
}
#+end_example


It works, but it seems to eventually encounter input without all args
